"""
2023年12月16日授業 宿題1
['スペイン', 'イギリス', 'イギリス', 'フランス', 'イタリア', 'イタリア', 'スペイン', 'イギリス', 'ドイツ', 'イタリア', 'イタリア', 'イタリア', 'スペイン', 'イタリア', 'イタリア', 'スペイン', 'イギリス', 'ドイツ', 'スペイン', 'イタリア', 'フランス', 'フランス', 'イタリア', 'イタリア', 'スペイン', 'フランス', 'スペイン', 'イタリア', 'スペイン', 'ドイツ', 'イタリア', 'イタリア', 'フランス', 'フランス', 'フランス', 'フランス', 'イギリス', 'イタリア', 'フランス', 'イギリス']
上記のようなリストを手で入力するのは難しいし、間違いも発生する。
answers = random_list({'イギリス': 6, 'スペイン': 8, 'ドイツ': 3, 'フランス': 9, 'イタリア': 14})
引数として国名をキー、投票数を値とする辞書を受け取り、最初のリストのようなランダムはリストを返す
関数を作成する。
"""
def random_list(country_map):
    pass
